<!-- add-pr-comment:add-pr-comment -->

### Terraform Plan (`infra`)
```
module.alpha_ingest_dev.data.archive_file.alpha_vantage_zip: Reading...
module.alpha_ingest_dev.data.archive_file.alpha_vantage_zip: Read complete after 0s [id=5376557ad42d97242d435207e6867e0922ba9c86]
module.alpha_ingest_dev.aws_iam_policy.alpha_vantage_ingest: Preparing import... [id=arn:aws:iam::237871399966:policy/capalyx-alpha-ingest-dev-policy]
module.alpha_ingest_dev.aws_iam_policy.alpha_vantage_ingest: Refreshing state... [id=arn:aws:iam::237871399966:policy/capalyx-alpha-ingest-dev-policy]
module.alpha_ingest_dev.aws_cloudwatch_event_rule.alpha_vantage_daily: Refreshing state... [id=capalyx-alpha-vantage-daily-dev]
module.alpha_ingest_dev.aws_iam_role.alpha_vantage_ingest: Refreshing state... [id=capalyx-alpha-ingest-dev-role]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.alpha_ingest_dev.aws_cloudwatch_event_target.alpha_vantage_daily_lambda will be created
  + resource "aws_cloudwatch_event_target" "alpha_vantage_daily_lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + environment = "dev"
              + run_type    = "daily"
              + source      = "eventbridge"
            }
        )
      + rule           = "capalyx-alpha-vantage-daily-dev"
      + target_id      = "capalyx-alpha-vantage-dev"
    }

  # module.alpha_ingest_dev.aws_iam_policy.alpha_vantage_ingest will be imported
    resource "aws_iam_policy" "alpha_vantage_ingest" {
        arn              = "arn:aws:iam::237871399966:policy/capalyx-alpha-ingest-dev-policy"
        attachment_count = 0
        description      = "Allow Lambda to write to bronze S3 and read Alpha Vantage API key for dev"
        id               = "arn:aws:iam::237871399966:policy/capalyx-alpha-ingest-dev-policy"
        name             = "capalyx-alpha-ingest-dev-policy"
        name_prefix      = null
        path             = "/"
        policy           = jsonencode(
            {
                Statement = [
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:PutObjectAcl",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::ccapalyx-bronze-dev-237871399966-us-west-2/alpha_vantage/*",
                        ]
                        Sid      = "AllowWriteToBronzeBucket"
                    },
                    {
                        Action   = [
                            "secretsmanager:GetSecretValue",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:secretsmanager:us-west-2:237871399966:secret:capalyx/dev/alpha_vantage-cU1Eud"
                        Sid      = "AllowReadAlphaVantageSecret"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        policy_id        = "ANPATOYR5QQPFIVHINMCH"
        tags             = {}
        tags_all         = {}
    }

  # module.alpha_ingest_dev.aws_iam_role.alpha_vantage_ingest will be updated in-place
  ~ resource "aws_iam_role" "alpha_vantage_ingest" {
        id                    = "capalyx-alpha-ingest-dev-role"
        name                  = "capalyx-alpha-ingest-dev-role"
      ~ tags                  = {
          - "Env"         = "dev" -> null
          + "Environment" = "dev"
          + "Owner"       = "DataPlatform"
          ~ "Project"     = "capalyx" -> "Capalyx"
        }
      ~ tags_all              = {
          - "Env"         = "dev" -> null
          + "Environment" = "dev"
          + "Owner"       = "DataPlatform"
          ~ "Project"     = "capalyx" -> "Capalyx"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.alpha_ingest_dev.aws_iam_role_policy_attachment.alpha_vantage_ingest_basic_logs will be created
  + resource "aws_iam_role_policy_attachment" "alpha_vantage_ingest_basic_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "capalyx-alpha-ingest-dev-role"
    }

  # module.alpha_ingest_dev.aws_iam_role_policy_attachment.alpha_vantage_ingest_custom will be created
  + resource "aws_iam_role_policy_attachment" "alpha_vantage_ingest_custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::237871399966:policy/capalyx-alpha-ingest-dev-policy"
      + role       = "capalyx-alpha-ingest-dev-role"
    }

  # module.alpha_ingest_dev.aws_lambda_function.alpha_vantage_ingest will be created
  + resource "aws_lambda_function" "alpha_vantage_ingest" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Alpha Vantage -> bronze S3 ingestion (no fan-out) for dev"
      + filename                       = "ingestion/alpha-vantage/dist/alpha_vantage_ingest.zip"
      + function_name                  = "capalyx-alpha-ingest-dev"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::237871399966:role/capalyx-alpha-ingest-dev-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "UHwjNQySbvvHAz/d0gJZgx59oJLicZ8HlJJjcWDKqwQ="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "Owner"       = "DataPlatform"
          + "Project"     = "Capalyx"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "Owner"       = "DataPlatform"
          + "Project"     = "Capalyx"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ALPHA_VANTAGE_API_KEY_SECRET_ARN" = "arn:aws:secretsmanager:us-west-2:237871399966:secret:capalyx/dev/alpha_vantage-cU1Eud"
              + "ALPHA_VANTAGE_BASE_URL"           = "https://www.alphavantage.co/query"
              + "ALPHA_VANTAGE_FUNCTION"           = "TIME_SERIES_DAILY_ADJUSTED"
              + "BRONZE_BUCKET"                    = "ccapalyx-bronze-dev-237871399966-us-west-2"
              + "REQUEST_INTERVAL_SECONDS"         = "12"
              + "SYMBOLS"                          = "AAPL,MSFT,GOOGL,AMZN,META,TSLA,NVDA,SPY,QQQ,IWM"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.alpha_ingest_dev.aws_lambda_permission.allow_events_alpha_vantage_daily will be created
  + resource "aws_lambda_permission" "allow_events_alpha_vantage_daily" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "capalyx-alpha-ingest-dev"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:us-west-2:237871399966:rule/capalyx-alpha-vantage-daily-dev"
      + statement_id        = "AllowExecutionFromCloudWatchEvents-dev"
      + statement_id_prefix = (known after apply)
    }

Plan: 1 to import, 5 to add, 1 to change, 0 to destroy.

```